src/СРМ/src/Documents/КорректировкаДолга/КорректировкаДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаДолга</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <attributes>
    <name>ВидКорректировки</name>
    <type>
      <types>EnumRef.ВидКорректировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКоректировкаДолга</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорИсточник</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КБКИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВзаиморасчетов</name>
    <type>
      <types>EnumRef.ТипыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИсточник</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеренесенИз77</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректироватьЧерезСторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СдвигатьДатуПоследнегоНачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

src/СРМ/src/Enums/ВидыОперацийКоректировкаДолга/ВидыОперацийКоректировкаДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКоректировкаДолга</name>
  <enumValues>
    <name>КорректировкаДолга</name>
  </enumValues>
  <enumValues>
    <name>ПеренесениеДолга</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Documents/КорректировкаДолга/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	ОтображатьРеквизитыИсточника = (Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.ВидыОперацийКоректировкаДолга.ПеренесениеДолга"));
	Элементы.ГруппаДоговорИсточник.Видимость=ОтображатьРеквизитыИсточника;
	Элементы.ТекущаяЗадолженностьИсточника.Видимость = ОтображатьРеквизитыИсточника;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	ОбновитьЗадолженностьПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗадолженностьПоДоговору(ОбновлятьПоИсточнику = Истина, ОбновлятьПоПриемнику = Истина)
	
	Если ОбновлятьПоИсточнику Тогда
		ТекущаяЗадолженностьИсточника = Аренда.ПолучитьЗадолженностьПоДоговору(КонецДня(Объект.Дата), Объект.ДоговорИсточник, Объект.КБКИсточник, Объект.ТипВзаиморасчетов, Объект.Контрагент);
	КонецЕсли;
	
	Если ОбновлятьПоПриемнику Тогда
		ТекущаяЗадолженностьКонтрагента = Аренда.ПолучитьЗадолженностьПоДоговору(КонецДня(Объект.Дата), Объект.Договор, Объект.КБК, Объект.ТипВзаиморасчетов, Объект.КонтрагентИсточник);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	СтруктуаДоговора=Аренда.ПолучитьСтруктуруДАнныхДоговора(Объект.Дата,Объект.Договор);
	
	Объект.КБК=СтруктуаДоговора.КБК;
	Объект.Контрагент = СтруктуаДоговора.Контрагент;
	
	ОбновитьЗадолженностьПоДоговору(Ложь, Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ДоговорИсточникПриИзменении(Элемент)
	
	СтруктуаДоговора=Аренда.ПолучитьСтруктуруДАнныхДоговора(Объект.Дата,Объект.ДоговорИсточник);
	
	Объект.КБКИсточник=СтруктуаДоговора.КБК;
	Объект.КонтрагентИсточник = СтруктуаДоговора.Контрагент;
	
	ОбновитьЗадолженностьПоДоговору(Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КБКИсточникПриИзменении(Элемент)
	ОбновитьЗадолженностьПоДоговору(Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КБКПриИзменении(Элемент)
	ОбновитьЗадолженностьПоДоговору(Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КорректируемыйМесяцПриИзменении(Элемент)
	
	Объект.КорректируемыйМесяц = НачалоМесяца(Объект.КорректируемыйМесяц);
	ОбновитьЗадолженностьПоДоговору();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбновитьЗадолженностьПоДоговору();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентИсточникПриИзменении(Элемент)
	ОбновитьЗадолженностьПоДоговору(Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОбновитьЗадолженностьПоДоговору(Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Если ЗначениеЗаполнено(Объект.КонтрагентИсточник) Тогда
		Отбор.Вставить("Контрагент", Объект.КонтрагентИсточник);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Отбор.Вставить("Контрагент", Объект.Контрагент);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
